In [1]:
import pandas as pd
import numpy as np
import os

In [3]:
os.chdir('D:\\Education\\Extra\\Machine Learning\\Coding File\\Statistic\\Data File')

In [4]:
#os.ge()
df = pd.read_csv("Example - 1.csv", names=["name","Value"],skiprows=[0])
df

     name    Value
0   Jagat     1000
1  Chaman     2000
2     Raj     3000
3    Axit     5000
4    Kalu     8000
5    Elon  1000000

In [5]:
df.describe() #will give all the statistic

                Value
count        6.000000
mean    169833.333333
std     406704.520096
min       1000.000000
25%       2250.000000
50%       4000.000000
75%       7250.000000
max    1000000.000000

In [30]:
income = df.Value.quantile(0.99) # FInding the outliner the outliner
income

950400.0000000002

In [32]:
find_outliner = df[df.Value <= df.Value.quantile(0.99)]  # Removing the outliner. Now this data set is more then clean
find_outliner

     name  Value
0   Jagat   1000
1  Chaman   2000
2     Raj   3000
3    Axit   5000
4    Kalu   8000

In [34]:
df['Value'][2] = np.nan
df

C:\Users\axitk\AppData\Local\Temp\ipykernel_15496\3349733841.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Value'][2] = np.nan

     name      Value
0   Jagat     1000.0
1  Chaman     2000.0
2     Raj        NaN
3    Axit     5000.0
4    Kalu     8000.0
5    Elon  1000000.0

In [37]:
df_new = df.fillna(df.Value.median())
df_new

     name      Value
0   Jagat     1000.0
1  Chaman     2000.0
2     Raj     5000.0
3    Axit     5000.0
4    Kalu     8000.0
5    Elon  1000000.0

In [38]:
df_new.describe()

                Value
count        6.000000
mean    170166.666667
std     406541.223822
min       1000.000000
25%       2750.000000
50%       5000.000000
75%       7250.000000
max    1000000.000000